read_verilog -sv test1.v # sv
read_liberty -lib ../../osu018_stdcells.lib #lib
proc
flatten
synth -auto-top
write_verilog synth1.v
dfflibmap -liberty ../../osu018_stdcells.lib
abc -D 5000 -liberty ../../osu018_stdcells.lib
stat -liberty ../../osu018_stdcells.lib
write_verilog gate1.v
show
#show -viewer gvedit # for windows user
